In [32]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass

In [33]:
password = getpass.getpass()

········

In [34]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [35]:
#1 How many distinct (different) actors' last names are there?
query = 'SELECT count(distinct last_name) as "distinct last names" FROM actor;'
data = pd.read_sql_query(query, engine)
data.head()

   distinct last names
0                  121

In [49]:
#Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
query = '''SELECT *,
case
WHEN (date_format(rental_date, '%a')) in ('Sat', 'Sun') then 'weekend'
else 'workday'
END AS 'day_type'
FROM rental
LIMIT 20;'''
data = pd.read_sql_query(query, engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday

In [56]:
#3 Get all films with ARMAGEDDON in the title.
query = '''SELECT * 
FROM film
where title like "%%armageddon%%";'''
data = pd.read_sql_query(query, engine)
data.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [38]:
#4 Get 10 the longest films.
query = '''SELECT title, length
FROM film
order by length desc;'''
data = pd.read_sql_query(query, engine)
data.head(10)

                title  length
0       CHICAGO NORTH     185
1      CONTROL ANTHEM     185
2      DARN FORRESTER     185
3         GANGS PRIDE     185
4           HOME PITY     185
5       MUSCLE BRIGHT     185
6        POND SEATTLE     185
7  SOLDIERS EVOLUTION     185
8   SWEET BROTHERHOOD     185
9        WORST BANGER     185

In [57]:
#5 How many films include Behind the Scenes content?
query = '''SELECT count(special_features) as 'Films with Behind the Scenes content'
FROM film
WHERE special_features LIKE '%%Behind the Scenes%%';'''
data = pd.read_sql_query(query, engine)
data.head(10)

   Films with Behind the Scenes content
0                                   538

In [53]:
#6Which kind of movies (rating) have a mean duration of more than two hours?
query = '''SELECT c.name, round(avg(length),2) as 'mean_duration' 
FROM category c 
JOIN film_category fc USING(category_id)
JOIN film f USING(film_id)
GROUP BY c.name
HAVING mean_duration > 120;'''
data = pd.read_sql_query(query, engine)
data.head(10)

      name  mean_duration
0    Drama         120.84
1  Foreign         121.70
2    Games         127.84
3   Sports         128.20

In [54]:
#7 Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.
query = '''SELECT title, length, rank() over (order by length desc) as 'rank'
FROM film 
WHERE length >0 and length is not NULL
ORDER BY length desc;'''
data = pd.read_sql_query(query, engine)
data.head(10)

                title  length  rank
0       CHICAGO NORTH     185     1
1      CONTROL ANTHEM     185     1
2      DARN FORRESTER     185     1
3         GANGS PRIDE     185     1
4           HOME PITY     185     1
5       MUSCLE BRIGHT     185     1
6        POND SEATTLE     185     1
7  SOLDIERS EVOLUTION     185     1
8   SWEET BROTHERHOOD     185     1
9        WORST BANGER     185     1